In [2]:
# Slicing DataFrames
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

dataframe.iloc[0]

dataframe.iloc[1:4]

dataframe.iloc[:4]

dataframe = dataframe.set_index(dataframe['Name'])

dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [3]:
# Selecting Rows Based on Conditionals

dataframe = pd.read_csv(url)

dataframe[dataframe['Sex'] == 'female'].head(2)

dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [4]:
# Sorting Values

dataframe.sort_values(by=["Age"]).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
763,"Dean, Miss Elizabeth Gladys (Millvena)",3rd,0.17,female,1,1
751,"Danbom, Master Gilbert Sigvard Emanuel",3rd,0.33,male,0,0

In [6]:
# Replacing Values
dataframe['Sex'].replace("female", "woman").head(2)

dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5)

dataframe.replace(1, "One").head(2)

dataframe.replace(r"1st", "First", regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

In [19]:
# Renaming Column
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

dataframe.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)


import collections

column_names = collections.defaultdict(str)

for name in dataframe.columns:
    column_names[name]

column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [22]:
# Finding the Minimum, Maximum, Sum, Average, and Count
dataframe = pd.read_csv(url)

print('Maximum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

dataframe.count()

Maximum: 71.0
Minimum: 0.17
Mean: 30.397989417989418
Sum: 22980.88
Count: 756

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [28]:
# Finding Unique Values
dataframe['Sex'].unique()

dataframe['Sex'].value_counts()

dataframe['PClass'].value_counts()

dataframe['PClass'].nunique()

4

In [47]:
# Handling Missing Values
dataframe[dataframe['Age'].isnull()].head(2)

# dataframe['Sex'] = dataframe['Sex'].replace('male', NaN)
# NameError: name 'NaN' is not defined

import numpy as np

dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

dataframe = pd.read_csv(url, na_values=[np.nan, 'None', -999])

null_entry = dataframe[dataframe['Age'].isna()].head(2)

print(null_entry)

null_entry.fillna(dataframe['Age'].mean())

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

                            Name PClass        Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  30.397989  female         1        1
13      Barkworth, Mr Algernon H    1st  30.397989    male         1        0

In [59]:
# Deleting a Column
dataframe.drop('Age', axis=1).head(2)

dataframe.drop(['PClass', 'Sex'], axis=1).head(2)

dataframe.drop(dataframe.columns[1], axis=1).head(2)

dataframe_name_dropped = dataframe.drop(dataframe.columns[0], axis=1)
dataframe_name_dropped

     PClass    Age     Sex  Survived  SexCode
0       1st  29.00  female         1        1
1       1st   2.00  female         0        1
2       1st  30.00    male         0        0
3       1st  25.00  female         0        1
4       1st   0.92    male         1        0
...     ...    ...     ...       ...      ...
1308    3rd  27.00    male         0        0
1309    3rd  26.00    male         0        0
1310    3rd  22.00    male         0        0
1311    3rd  24.00    male         0        0
1312    3rd  29.00    male         0        0

[1313 rows x 5 columns]

In [64]:
# Deleting a Row
dataframe[dataframe['Sex'] != 'male'].head(3)

dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

dataframe[dataframe.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [69]:
# Dropping Duplicate Rows
dataframe.drop_duplicates().head(2) # expect no changes, all rows are unique

dataframe.drop_duplicates(subset=['Sex'])

dataframe.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [78]:
# Grouping Rows by Values
dataframe.groupby('Sex').mean(numeric_only=True)

dataframe.groupby('PClass').mean(numeric_only=True)

dataframe.groupby('Sex') # needs to be paired with some operation such as mean, median, sum

dataframe.groupby('Survived')['Name'].count()

dataframe.groupby(['Sex', 'Survived'])['Age'].mean()

dataframe.groupby(['Survived', 'Sex'])['Age'].mean()

Survived  Sex
0         female    24.901408
          male      32.320780
1         female    30.867143
          male      25.951875
Name: Age, dtype: float64

In [91]:
# Grouping Rows by Time
import pandas as pd
import numpy as np

# create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

dataframe = pd.DataFrame(index=time_index)

dataframe['Sale_Amount'] = np.random.randint(1,10,100000)

dataframe.resample('W').sum() # group rows per week

dataframe.resample('2W').mean()

dataframe.resample('M').count()

dataframe.resample('M', label='left').count()

C:\Users\christopherli\AppData\Local\Temp\ipykernel_26516\4094811256.py:6: FutureWarning: 'S' is deprecated and will be removed in a future version, please use 's' instead.
  time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
C:\Users\christopherli\AppData\Local\Temp\ipykernel_26516\4094811256.py:16: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample('M').count()
C:\Users\christopherli\AppData\Local\Temp\ipykernel_26516\4094811256.py:18: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [98]:
# Aggregating Operations and Statistics

dataframe = pd.read_csv(url)

dataframe.agg("min")

dataframe.agg({"Age": ["mean"], "SexCode": ["min", "max"]})

dataframe.groupby(["PClass", "Survived"]).agg({"Survived":["count"]}).reset_index()

  PClass Survived
                  count
0      *        0     1
1    1st        0   129
2    1st        1   193
3    2nd        0   160
4    2nd        1   119
5    3rd        0   573
6    3rd        1   138

In [105]:
# Looping over a Column

for name in dataframe['Name'][0:2]: # just like any other sequence in python
    print(name.upper())

[name.upper() for name in dataframe['Name'][0:2]]

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [107]:
# Applying a Function over All Elements in a Column

def uppercase(x):
    return x.upper()

dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [109]:
# Applying a Function to Groups
# Combine groupby and apply

dataframe.groupby('Sex').apply(lambda x: x.count())

C:\Users\christopherli\AppData\Local\Temp\ipykernel_26516\209060795.py:4: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [114]:
# Concatenating DataFrames

data_a = {'id': ['1', '2', '3'],
          'first': ['Alex', 'Amy', 'Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns=['id', 'first', 'last'])

data_b = {'id': ['4', '5', '6'],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [122]:
# Merging DataFrames

employee_data = {'employee_id': ['1', '2', '3', '4'],
                 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

sales_data = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

pd.merge(dataframe_employees, dataframe_sales, on='employee_id') # inner joins

pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer') # outer joins

pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left') # left joins (dataframe_employees)
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right') # right joins (dataframe_sales)

pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512